const NTUFieldToMajorMap = {
  '文史哲學群': [ '中國文學系', '歷史學系', '哲學系', '圖書資訊學系' ],
  '外語學群': [ '外國語文學系', '日本語文學系' ],
  '社會心理學群': [ '人類學系', '心理學系', '社會學系', '社會工作學系' ],
  '資訊學群': [ '圖書資訊學系', '資訊管理學系', '電機工程學系', '資訊工程學系' ],
  '藝術學群': [ '戲劇學系' ],
  '數理化學群': [ '數學系', '物理學系', '化學系' ],
  '地球環境學群': [ '地質科學系', '地理環境資源學系', '大氣科學系' ],
  '法政學群': [ '政治學系', '法律學系' ],
  '財經學群': [ '經濟學系', '農業經濟學系', '工商管理學系', '會計學系', '財務金融學系', '國際企業學系' ],
  '醫藥衛生學群': [ '醫學系', '護理學系', '醫學檢驗暨生物技術學系', '物理治療學系', '職能治療學系', '藥學系', '獸醫學系', '公共衛生學系' ],
  '工程學群': [ '土木工程學系', '機械工程學系', '化學工程學系', '工程科學及海洋工程學系', '材料科學與工程學系', '醫學工程學系', '生物環境系統工程學系', '生物機電工程學系', '電機工程學系', '資訊工程學系' ],
  '生物資源學群': [ '農藝學系', '農業化學系', '森林環境暨資源學系', '動物科學技術學系', '農業經濟學系', '園藝暨景觀學系', '生物產業傳播暨發展學系', '昆蟲學系', '植物病理與微生物學系', '獸醫學系' ],
  '大眾傳播學群': [ '生物產業傳播暨發展學系' ],
  '管理學群': [ '工商管理學系', '國際企業學系', '資訊管理學系' ],
  '生命科學學群': [ '生命科學系', '生化科技學系' ]
};

export { NTUFieldToMajorMap }